app/controllers/answers_controller.rb

  def create
    question = Question.find(params[:answer][:question_id])
    answer = question.answers.create(answer_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 32]]
INSERT INTO "answers" ("email", "body", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "patrice142@msn.com"], ["body", "Guyana population is 880,000"], ["question_id", 32], ["created_at", "2017-09-19 16:51:50.943437"], ["updated_at", "2017-09-19 16:51:50.943437"]]