app/controllers/questions_controller.rb

  def show
    @question = Question.find(params[:id])

    @answers = @question.answers.order(created_at: :desc)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 31]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  ORDER BY "answers"."created_at" DESC  [["question_id", 31]]

  def create
    Question.create(question_params)
---
INSERT INTO "questions" ("email", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "muniner1@gmail.com"], ["body", "what is the population in Guyana"], ["created_at", "2017-09-19 16:42:14.569169"], ["updated_at", "2017-09-19 16:42:14.569169"]]